app/views/lists/show.html.erb

      <!-- form_for(item.new), url list_items_path(@list) -->
      <%= f.text_field :description, :class => "new-todo", :placeholder => (@item.errors.full_messages_for(:description).first || "Enter a New Item...") %>
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 1]]