app/controllers/items_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "oil"], ["list_id", 1], ["created_at", "2016-08-05 01:02:42.027893"], ["updated_at", "2016-08-05 01:02:42.027893"]]
---
  def create
    @list = List.find(params[:list_id])
    @item = @list.items.build(item_params)
    if @item.save

UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", 0], ["updated_at", "2016-08-05 17:15:59.190624"], ["id", 1]]
---
  def update
    set_item
    @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
---
  def destroy
    set_item
    @item.destroy

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", nil]]
---
  def set_item
    @item = Item.find(params[:id])