app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    @list = List.new
    @lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @list = List.find(params[:id])

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "First List"], ["created_at", "2016-08-04 21:34:06.335846"], ["updated_at", "2016-08-04 21:34:06.335846"]]
SELECT "lists".* FROM "lists"
---
  def create
    @list = List.new(list_params)
    if @list.save
      redirect_to @list
    else
      @lists = List.all